//県名から市町村タグを作成
function make_select_city(){
    var ken = $("#ken_select").val();
    var ci = getCityNamesFromKen(ken);//市町村配列取得
    var id = "#city_select";
    $(id).children().remove();//セレクトをリセット
    for(var yohouku in ci){
        var ci_names = ci[yohouku].split("_");
        for(i=0;i<ci_names.length;i++){
            //console.log(yohouku + "_"+ ci_names[i]);
            $(id).append($("<option>").val(yohouku + "_"+ ci_names[i]).text(ci_names[i]));
        }
    }
}
function getCityNamesFromKen(ken){
    var citys = new Array();
    if(ken == "宗谷地方"){
        citys["宗谷地方"] ="稚内市_猿払村_豊富町_幌延町_浜頓別町_中頓別町_枝幸町_礼文町_利尻町_利尻富士町";
    }else if(ken == "上川・留萌地方"){
        citys["上川地方"] ="士別市_名寄市_和寒町_剣淵町_下川町_美深町_音威子府村_中川町_幌加内町_旭川市_鷹栖町_東神楽町_当麻町_比布町_愛別町_上川町_東川町_美瑛町_富良野市_上富良野町_中富良野町_南富良野町_占冠村";
        citys["留萌地方"] ="遠別町_天塩町_苫前町_羽幌町_天売焼尻_初山別村_留萌市_増毛町_小平町";
    }else if(ken == "網走・北見・紋別地方"){
        citys["網走地方"] ="斜里町_清里町_小清水町_北見市常呂_網走市_佐呂間町_大空町_美幌町_津別町";
        citys["北見地方"] ="北見市北見_訓子府町_置戸町";
        citys["紋別地方"] ="紋別市_滝上町_興部町_西興部村_雄武町_遠軽町_湧別町";
    }else if(ken == "釧路・根室・十勝地方"){
        citys["釧路地方"] ="弟子屈町_釧路市阿寒_標茶町_鶴居村_厚岸町_浜中町_釧路市釧路_釧路市音別_釧路町_白糠町";
        citys["根室地方"] ="中標津町_標津町_羅臼町_別海町_根室市";
        citys["十勝地方"] ="上士幌町_鹿追町_新得町_足寄町_陸別町_帯広市_音更町_士幌町_清水町_芽室町_幕別町_池田町_豊頃町_本別町_浦幌町_中札内村_更別村_大樹町_広尾町";
    }else if(ken == "胆振・日高地方"){
        citys["胆振地方"] ="伊達市伊達_伊達市大滝_豊浦町_壮瞥町_洞爺湖町_室蘭市_苫小牧市_登別市_白老町_厚真町_安平町_むかわ町";
        citys["日高地方"] ="日高町日高_日高町門別_平取町_新冠町_新ひだか町_浦河町_様似町_えりも町";
    }else if(ken == "石狩・空知・後志地方"){
        citys["石狩地方"] ="石狩市_当別町_新篠津村_札幌市_江別市_千歳市_恵庭市_北広島市";
        citys["空知地方"] ="深川市_妹背牛町_秩父別町_北竜町_沼田町_芦別市_赤平市_滝川市_砂川市_歌志内市_奈井江町_上砂川町_浦臼町_新十津川町_雨竜町_夕張市_岩見沢市_美唄市_三笠市_南幌町_由仁町_長沼町_栗山町_月形町";
        citys["後志地方"] ="小樽市_積丹町_古平町_仁木町_余市町_赤井川村_ニセコ町_真狩村_留寿都村_喜茂別町_京極町_倶知安町_島牧村_寿都町_黒松内町_蘭越町_共和町_岩内町_泊村_神恵内村";
    }else if(ken == "渡島・檜山地方"){
        citys["渡島地方"] ="八雲町八雲_長万部町_函館市_北斗市_七飯町_鹿部町_森町_松前町_福島町_知内町_木古内町";
        citys["檜山地方"] ="八雲町熊石_今金町_せたな町_江差町_上ノ国町_厚沢部町_乙部町_奥尻町";
    }else if(ken == "青森県"){
        citys["津軽"] ="青森市_平内町_今別町_蓬田村_外ヶ浜町_五所川原市_板柳町_鶴田町_中泊町_つがる市_鰺ヶ沢町_深浦町_弘前市_黒石市_平川市_西目屋村_藤崎町_大鰐町_田舎館村";
        citys["下北"] ="むつ市_大間町_東通村_風間浦村_佐井村";
        citys["三八上北"] ="八戸市_三沢市_六戸町_おいらせ町_三戸町_五戸町_田子町_南部町_階上町_新郷村_十和田市_野辺地町_七戸町_横浜町_東北町_六ヶ所村";
    }else if(ken == "岩手県"){
        citys["内陸"] ="二戸市_軽米町_九戸村_一戸町、盛岡市_八幡平市_滝沢市_雫石町_葛巻町_岩手町_紫波町_矢巾町_花巻市_北上市_西和賀町_遠野市_奥州市_金ケ崎町_一関市_平泉町";
        citys["沿岸北部"] ="久慈市_普代村_野田村_洋野町_宮古市_山田町_岩泉町_田野畑村";
        citys["沿岸南部"] ="釜石市_大槌町_大船渡市_陸前高田市_住田町";
    }else if(ken == "宮城県"){
        citys["東部"] ="気仙沼市_南三陸町_石巻市_東松島市_女川町_登米市_栗原市東部_大崎市東部_涌谷町_美里町_仙台市東部_塩竈市_名取市_多賀城市_岩沼市_富谷市_亘理町_山元町_松島町_七ヶ浜町_利府町_大和町東部_大郷町_角田市_大河原町_村田町_柴田町_丸森町";
        citys["西部"] ="栗原市西部_大崎市西部_色麻町_加美町_仙台市西部_大和町西部_大衡村_白石市_蔵王町_七ヶ宿町_川崎町";
    }else if(ken == "秋田県"){
        citys["沿岸"] ="能代市_藤里町_三種町_八峰町_秋田市_男鹿市_潟上市_五城目町_八郎潟町_井川町_大潟村_由利本荘市_にかほ市";
        citys["内陸"] ="大館市_鹿角市_北秋田市_小坂町_上小阿仁村_横手市_大仙市_仙北市_美郷町_湯沢市_羽後町_東成瀬村";
    }else if(ken == "山形県"){
        citys["村山"] ="村山市_東根市_尾花沢市_大石田町_寒河江市_河北町_西川町_朝日町_大江町_山形市_上山市_天童市_山辺町_中山町";
        citys["置賜"] ="米沢市_南陽市_高畠町_川西町_長井市_小国町_白鷹町_飯豊町";
        citys["庄内"] ="酒田市_遊佐町_鶴岡市_三川町_庄内町";
        citys["最上"] ="新庄市_金山町_最上町_舟形町_真室川町_大蔵村_鮭川村_戸沢村";
    }else if(ken == "福島県"){
        citys["中通り"] ="福島市_伊達市_桑折町_国見町_川俣町_郡山市_須賀川市_二本松市_田村市_本宮市_大玉村_鏡石町_天栄村_三春町_小野町_白河市_西郷村_泉崎村_中島村_矢吹町_棚倉町_矢祭町_塙町_鮫川村_石川町_玉川村_平田村_浅川町_古殿町";
        citys["浜通り"] ="相馬市_南相馬市_新地町_飯舘村_広野町_楢葉町_富岡町_川内村_大熊町_双葉町_浪江町_葛尾村_いわき市";
        citys["会津"] ="喜多方市_北塩原村_西会津町_磐梯町_猪苗代町_会津若松市_郡山市湖南_会津坂下町_湯川村_柳津町_三島町_金山町_昭和村_会津美里町_天栄村湯本_下郷町_檜枝岐村_只見町_南会津町";
    }else if(ken == "茨城県"){
        citys["北部"] ="日立市_常陸太田市_高萩市_北茨城市_ひたちなか市_常陸大宮市_那珂市_東海村_大子町_水戸市_笠間市_小美玉市_茨城町_大洗町_城里町";
        citys["南部"] ="鹿嶋市_潮来市_神栖市_行方市_鉾田市_土浦市_石岡市_龍ケ崎市_取手市_牛久市_つくば市_守谷市_稲敷市_かすみがうら市_つくばみらい市_美浦村_阿見町_河内町_利根町_古河市_結城市_下妻市_常総市_筑西市_坂東市_桜川市_八千代町_五霞町_境町";
    }else if(ken == "栃木県"){
        citys["北部"] ="大田原市_矢板市_那須塩原市_塩谷町_那須町_日光市";
        citys["南部"] ="真岡市_那須烏山市_益子町_茂木町_市貝町_芳賀町_那珂川町_宇都宮市_さくら市_上三川町_高根沢町_足利市_栃木市_佐野市_鹿沼市_小山市_下野市_壬生町_野木町";
    }else if(ken == "群馬県"){
        citys["北部"] ="沼田市_片品村_川場村_昭和村_みなかみ町_中之条町_長野原町_嬬恋村_草津町_高山村_東吾妻町";
        citys["南部"] ="前橋市_桐生市_渋川市_みどり市_榛東村_吉岡町_伊勢崎市_太田市_館林市_玉村町_板倉町_明和町_千代田町_大泉町_邑楽町_高崎市_藤岡市_富岡市_安中市_上野村_神流町_下仁田町_南牧村_甘楽町";
    }else if(ken == "埼玉県"){
        citys["南部"] ="春日部市_草加市_越谷市_八潮市_三郷市_蓮田市_幸手市_吉川市_白岡市_宮代町_杉戸町_松伏町_さいたま市_川越市_川口市_所沢市_狭山市_上尾市_蕨市_戸田市_朝霞市_志木市_和光市_新座市_桶川市_北本市_富士見市_ふじみ野市_伊奈町_三芳町_川島町_飯能市_入間市_坂戸市_鶴ヶ島市_日高市_毛呂山町_越生町";
        citys["北部"] ="行田市_加須市_羽生市_鴻巣市_久喜市_熊谷市_本庄市_東松山市_深谷市_滑川町_嵐山町_小川町_吉見町_鳩山町_ときがわ町_東秩父村_美里町_神川町_上里町_寄居町";
        citys["秩父地方"] ="秩父市_横瀬町_皆野町_長瀞町_小鹿野町";
    }else if(ken == "千葉県"){
        citys["北東部"] ="銚子市_旭市_匝瑳市_香取市_神崎町_多古町_東庄町_茂原市_東金市_山武市_大網白里市_九十九里町_芝山町_横芝光町_一宮町_睦沢町_長生村_白子町_長柄町_長南町";
        citys["北西部"] ="成田市_佐倉市_四街道市_八街市_印西市_白井市_富里市_酒々井町_栄町_市川市_船橋市_松戸市_野田市_習志野市_柏市_流山市_八千代市_我孫子市_鎌ヶ谷市_浦安市_千葉市_市原市";
        citys["南部"] ="木更津市_君津市_富津市_袖ヶ浦市_館山市_勝浦市_鴨川市_南房総市_いすみ市_大多喜町_御宿町_鋸南町";
    }else if(ken == "東京都"){
        citys["東京地方"] ="台東区_墨田区_江東区_荒川区_足立区_葛飾区_江戸川区_千代田区_中央区_港区_新宿区_文京区_品川区_目黒区_大田区_世田谷区_渋谷区_中野区_杉並区_豊島区_北区_板橋区_練馬区_立川市_武蔵野市_三鷹市_府中市_昭島市_調布市_小金井市_小平市_東村山市_国分寺市_国立市_狛江市_東大和市_清瀬市_東久留米市_武蔵村山市_西東京市_青梅市_福生市_羽村市_あきる野市_瑞穂町_日の出町_檜原村_奥多摩町_八王子市_町田市_日野市_多摩市_稲城市";
        citys["伊豆諸島北部"] ="大島町_利島村_新島村_神津島村";
        citys["伊豆諸島南部"] ="三宅村_御蔵島村_八丈町_青ヶ島村";
        citys["小笠原諸島"] ="小笠原村";
    }else if(ken == "神奈川県"){
        citys["東部"] ="横浜市_川崎市_平塚市_藤沢市_茅ヶ崎市_大和市_海老名市_座間市_綾瀬市_寒川町_大磯町_二宮町_横須賀市_鎌倉市_逗子市_三浦市_葉山町";
        citys["西部"] ="相模原市_秦野市_厚木市_伊勢原市_愛川町_清川村_南足柄市_中井町_大井町_松田町_山北町_開成町_小田原市_箱根町_真鶴町_湯河原町";
    }else if(ken == "新潟県"){
        citys["上越"] ="上越市_糸魚川市_妙高市";
        citys["中越"] ="三条市_加茂市_田上町_魚沼市_長岡市_小千谷市_見附市_出雲崎町_柏崎市_刈羽村_南魚沼市_湯沢町_十日町市_津南町";
        citys["下越"] ="村上市_関川村_粟島浦村_新発田市_胎内市_聖籠町_新潟市_燕市_阿賀野市_弥彦村_五泉市_阿賀町";
        citys["佐渡"] ="佐渡市";
    }else if(ken == "富山県"){
        citys["東部"] ="朝日町_黒部市_魚津市_滑川市_入善町_富山市_舟橋村_上市町_立山町";
        citys["西部"] ="高岡市_氷見市_小矢部市_射水市_砺波市_南砺市";
    }else if(ken == "石川県"){
        citys["能登"] ="輪島市_珠洲市_穴水町_能登町_七尾市_羽咋市_志賀町_宝達志水町_中能登町";
        citys["加賀"] ="金沢市_かほく市_津幡町_内灘町_小松市_加賀市_白山市_能美市_川北町_野々市市";
    }else if(ken == "福井県"){
        citys["嶺北"] ="大野市_勝山市_福井市_あわら市_坂井市_永平寺町_越前町_鯖江市_越前市_池田町_南越前町";
        citys["嶺南"] ="敦賀市_美浜町_若狭町_小浜市_高浜町_おおい町";
    }else if(ken == "山梨県"){
        citys["東部・富士五湖"] ="都留市_大月市_上野原市_道志村_小菅村_丹波山村_富士吉田市_西桂町_忍野村_山中湖村_鳴沢村_富士河口湖町";
        citys["中・西部"] ="甲府市_韮崎市_南アルプス市_北杜市_甲斐市_中央市_昭和町_山梨市_笛吹市_甲州市_市川三郷町_富士川町_早川町_身延町_南部町";
    }else if(ken == "長野県"){
        citys["北部"] ="中野市_飯山市_山ノ内町_木島平村_野沢温泉村_栄村_長野市_須坂市_千曲市_坂城町_小布施町_高山村_信濃町_小川村_飯綱町_大町市_池田町_松川村_白馬村_小谷村";
        citys["中部"] ="上田市_東御市_青木村_長和町_小諸市_佐久市_小海町_川上村_南牧村_南相木村_北相木村_佐久穂町_軽井沢町_御代田町_立科町_松本_塩尻_安曇野市_麻績村_生坂村_山形村_朝日村_筑北村_乗鞍上高地_岡谷市_諏訪市_茅野市_下諏訪町_富士見町_原村";
        citys["南部"] ="伊那市_駒ヶ根市_辰野町_箕輪町_飯島町_南箕輪村_中川村_宮田村_楢川_上松町_南木曽町_木祖村_王滝村_大桑村_木曽町_飯田市_松川町_高森町_阿南町_阿智村_平谷村_根羽村_下條村_売木村_天龍村_泰阜村_喬木村_豊丘村_大鹿村";
    }else if(ken == "岐阜県"){
        citys["飛騨地方"] ="高山市_飛騨市_白川村_下呂市";
        citys["美濃地方"] ="岐阜市_大垣市_羽島市_各務原市_山県市_瑞穂市_本巣市_海津市_岐南町_笠松町_養老町_垂井町_関ケ原町_神戸町_輪之内町_安八町_揖斐川町_大野町_池田町_北方町_関市_美濃市_美濃加茂市_可児市_郡上市_坂祝町_富加町_川辺町_七宗町_八百津町_白川町_東白川村_御嵩町_多治見市_中津川市_瑞浪市_恵那市_土岐市";
    }else if(ken == "静岡県"){
        citys["伊豆"] ="熱海市_伊東市_伊豆市_伊豆の国市_函南町_下田市_東伊豆町_河津町_南伊豆町_松崎町_西伊豆町";
        citys["東部"] ="沼津市_三島市_御殿場市_裾野市_清水町_長泉町_小山町_富士宮市_富士市";
        citys["中部"] ="静岡市北部_川根本町_静岡市南部_島田市_焼津市_藤枝市_牧之原市_吉田町";
        citys["西部"] ="浜松市北部_浜松市南部_磐田市_掛川市_袋井市_湖西市_御前崎市_菊川市_森町";
    }else if(ken == "愛知県"){
        citys["東部"] ="新城市_設楽町_東栄町_豊根村_豊橋市_豊川市_蒲郡市_田原市_豊田市東部";
        citys["西部"] ="豊田市西部_みよし市_岡崎市_碧南市_刈谷市_安城市_西尾市_知立市_高浜市_幸田町_名古屋市_瀬戸市_春日井市_犬山市_小牧市_尾張旭市_豊明市_日進市_長久手市_東郷町_一宮市_津島市_江南市_稲沢市_岩倉市_愛西市_清須市_北名古屋市_弥富市_豊山町_大口町_扶桑町_あま市_大治町_蟹江町_飛島村_半田市_常滑市_東海市_大府市_知多市_阿久比町_東浦町_南知多町_美浜町_武豊町";
    }else if(ken == "三重県"){
        citys["北中部"] ="四日市市_桑名市_鈴鹿市_亀山市_いなべ市_木曽岬町_東員町_菰野町_朝日町_川越町_津市_松阪市_多気町_明和町_名張市_伊賀市";
        citys["南部"] ="伊勢市_鳥羽市_志摩市_玉城町_度会町_南伊勢町_尾鷲市_熊野市_大台町_大紀町_紀北町_御浜町_紀宝町";
    }else if(ken == "滋賀県"){
        citys["北部"] ="長浜市_米原市_彦根市_愛荘町_豊郷町_甲良町_多賀町_大津市北部_高島市";
        citys["南部"] ="近江八幡市_東近江市_日野町_竜王町_大津市南部_草津市_守山市_栗東市_野洲市_甲賀市_湖南市";
    }else if(ken == "京都府"){
        citys["北部"] ="宮津市_京丹後市_伊根町_与謝野町_舞鶴市_綾部市_福知山市";
        citys["南部"] ="南丹市_京丹波町_京都市_亀岡市_向日市_長岡京市_大山崎町_宇治市_城陽市_八幡市_京田辺市_久御山町_井手町_宇治田原町_木津川市_笠置町_和束町_精華町_南山城村";
    }else if(ken == "大阪府"){
        citys["大阪府"] ="豊中市_池田市_吹田市_高槻市_茨木市_箕面市_摂津市_島本町_豊能町_能勢町_守口市_枚方市_八尾市_寝屋川市_大東市_柏原市_門真市_東大阪市_四條畷市_交野市_大阪市_富田林市_河内長野市_松原市_羽曳野市_藤井寺市_大阪狭山市_太子町_河南町_千早赤阪村_堺市_岸和田市_泉大津市_貝塚市_泉佐野市_和泉市_高石市_泉南市_阪南市_忠岡町_熊取町_田尻町_岬町";
    }else if(ken == "兵庫県"){
        citys["北部"] ="豊岡市_香美町_新温泉町_養父市_朝来市";
        citys["南部"] ="西脇市_丹波篠山市_丹波市_多可町_宍粟市_市川町_福崎町_神河町_佐用町_神戸市_尼崎市_西宮市_芦屋市_伊丹市_宝塚市_川西市_三田市_猪名川町_明石市_加古川市_三木市_高砂市_小野市_加西市_加東市_稲美町_播磨町_姫路市_相生市_赤穂市_たつの市_太子町_上郡町_洲本市_南あわじ市_淡路市";
    }else if(ken == "奈良県"){
        citys["北部"] ="宇陀市_山添村_奈良市_大和高田市_大和郡山市_天理市_橿原市_桜井市_御所市_生駒市_香芝市_葛城市_平群町_三郷町_斑鳩町_安堵町_川西町_三宅町_田原本町_高取町_明日香村_上牧町_王寺町_広陵町_河合町_五條市北部_吉野町_大淀町_下市町";
        citys["南部"] ="曽爾村_御杖村_黒滝村_天川村_下北山村_上北山村_川上村_東吉野村_五條市南部_野迫川村_十津川村";
    }else if(ken == "和歌山県"){
        citys["北部"] ="和歌山市_海南市_橋本市_紀の川市_岩出市_紀美野町_かつらぎ町_九度山町_高野町_有田市_御坊市_湯浅町_広川町_有田川町_美浜町_日高町_由良町_印南町_みなべ町_日高川町";
        citys["南部"] ="新宮市_那智勝浦町_太地町_古座川町_北山村_串本町_田辺市田辺_田辺市龍神_田辺市中辺路_田辺市大塔_田辺市本宮_白浜町_上富田町_すさみ町";
    }else if(ken == "鳥取県"){
        citys["東部"] ="鳥取市北部_岩美町_鳥取市南部_若桜町_智頭町_八頭町";
        citys["中・西部"] ="倉吉市_三朝町_湯梨浜町_琴浦町_北栄町_米子市_境港市_日吉津村_大山町_南部町_伯耆町_日南町_日野町_江府町";
    }else if(ken == "島根県"){
        citys["東部"] ="松江市_安来市_出雲市_雲南市_奥出雲町_飯南町";
        citys["西部"] ="大田市_川本町_美郷町_邑南町_浜田市_江津市_益田市_津和野町_吉賀町";
        citys["隠岐"] ="海士町_西ノ島町_知夫村_隠岐の島町";        
    }else if(ken == "岡山県"){
        citys["北部"] ="美作市_勝央町_奈義町_西粟倉村_津山市_鏡野町_久米南町_美咲町_真庭市_新庄村_新見市";
        citys["南部"] ="備前市_赤磐市_和気町_岡山市_玉野市_瀬戸内市_吉備中央町_高梁市_倉敷市_総社市_早島町_笠岡市_井原市_浅口市_里庄町_矢掛町";
    }else if(ken == "広島県"){
        citys["北部"] ="三次市_庄原市_安芸高田市_安芸太田町_北広島町";
        citys["南部"] ="三原市_尾道市_福山市_府中市_世羅町_神石高原町_竹原市_東広島市_大崎上島町_広島市_呉市_大竹市_廿日市市_江田島市_府中町_海田町_熊野町_坂町";
    }else if(ken == "山口県"){
        citys["北部"] ="萩市_美祢市_阿武町_長門市";
        citys["東部"] ="岩国市_和木町_光市_柳井市_周防大島町_上関町_田布施町_平生町";
        citys["中部"] ="下松市_周南市_山口市_防府市";
        citys["西部"] ="下関市_宇部市_山陽小野田市";
    }else if(ken == "徳島県"){
        citys["北部"] ="徳島市_鳴門市_小松島市_松茂町_北島町_藍住町_板野町_吉野川市_阿波市_美馬市脇・美馬・穴吹_石井町_上板町_つるぎ町半田・貞光_美馬市木屋平_佐那河内村_神山町_つるぎ町一宇_三好市_東みよし町";
        citys["南部"] ="阿南市_勝浦町_上勝町_那賀町_牟岐町_美波町_海陽町";
    }else if(ken == "香川県"){
        citys["香川県"] ="土庄町_小豆島町_さぬき市_東かがわ市_三木町_高松市_直島町_丸亀市_坂出市_善通寺市_宇多津町_綾川町_琴平町_多度津町_まんのう町_観音寺市_三豊市";
    }else if(ken == "愛媛県"){
        citys["東予"] ="新居浜市_西条市_四国中央市_今治市_上島町";
        citys["中予"] ="松山市_伊予市_東温市_久万高原町_松前町_砥部町";
        citys["南予"] ="八幡浜市_大洲市_西予市_内子町_伊方町_宇和島市_松野町_鬼北町_愛南町";
    }else if(ken == "高知県"){
        citys["東部"] ="室戸市_東洋町_安芸市_奈半利町_田野町_安田町_北川村_馬路村_芸西村";
        citys["中部"] ="高知市_南国市_土佐市_須崎市_香南市_香美市_いの町_日高村_本山町_大豊町_土佐町_大川村_仁淀川町_佐川町_越知町";
        citys["西部"] ="中土佐町_檮原町_津野町_四万十町_宿毛市_土佐清水市_四万十市_大月町_三原村_黒潮町";
    }else if(ken == "福岡県"){
        citys["福岡地方"] ="福岡市_筑紫野市_春日市_大野城市_宗像市_太宰府市_古賀市_福津市_糸島市_那珂川市_宇美町_篠栗町_志免町_須恵町_新宮町_久山町_粕屋町";
        citys["北九州地方"] ="北九州市_中間市_芦屋町_水巻町_岡垣町_遠賀町_行橋市_豊前市_苅田町_みやこ町_吉富町_上毛町_築上町";
        citys["筑豊地方"] ="直方市_飯塚市_田川市_宮若市_嘉麻市_小竹町_鞍手町_桂川町_香春町_添田町_糸田町_川崎町_大任町_赤村_福智町";
        citys["筑後地方"] ="久留米市_小郡市_うきは市_朝倉市_筑前町_東峰村_大刀洗町_大牟田市_柳川市_八女市_筑後市_大川市_みやま市_大木町_広川町";
    }else if(ken=="佐賀県"){
        citys["北部"] ="唐津市_玄海町_伊万里市_有田町";
        citys["南部"] ="鳥栖市_神埼市_吉野ヶ里町_基山町_上峰町_みやき町_佐賀市_多久市_小城市_武雄市_大町町_江北町_白石町_鹿島市_嬉野市_太良町";
    }else if(ken == "長崎県"){
        citys["北部"] ="平戸市_松浦市_佐世保市（宇久地域を除く）_東彼杵町_川棚町_波佐見町_佐々町";
        citys["南部"] ="島原市_雲仙市_南島原市_諫早市_大村市_長崎市_長与町_時津町_西海市（江島・平島を除く）";
        citys["壱岐・対馬"] ="上対馬_下対馬_壱岐市";
        citys["五島"] ="佐世保市（宇久地域）_西海市（江島・平島）_小値賀町_新上五島町_五島市";
    }else if(ken == "熊本県"){
        citys["熊本地方"] ="山鹿市_菊池市_合志市_大津町_菊陽町_荒尾市_玉名市_玉東町_南関町_長洲町_和水町_熊本市_西原村_御船町_嘉島町_益城町_甲佐町_山都町_八代市_宇土市_宇城市_美里町_氷川町";
        citys["阿蘇地方"] ="阿蘇市_南小国町_小国町_産山村_高森町_南阿蘇村";
        citys["天草・芦北地方"] ="上天草市_天草市_苓北町_水俣市_芦北町_津奈木町";
        citys["球磨地方"] ="人吉市_錦町_多良木町_湯前町_水上村_相良村_五木村_山江村_球磨村_あさぎり町";
    }else if(ken == "大分県"){
        citys["北部"] ="中津市_豊後高田市_宇佐市_国東市_姫島村";
        citys["中部"] ="大分市_別府市_臼杵市_津久見市_杵築市_由布市_日出町";
        citys["南部"] ="佐伯市_豊後大野市";
        citys["西部"] ="日田市_九重町_玖珠町_竹田市";
    }else if(ken == "宮崎県"){
        citys["北部平野部"] ="延岡市_日向市_門川町_西都市_高鍋町_新富町_木城町_川南町_都農町";
        citys["北部山沿い"] ="高千穂町_日之影町_五ヶ瀬町_西米良村_諸塚村_椎葉村_美郷町";
        citys["南部平野部"] ="宮崎市_国富町_綾町_日南市_串間市";
        citys["南部山沿い"] ="小林市_えびの市_高原町_都城市_三股町";
    }else if(ken == "鹿児島県"){
        citys["薩摩地方"] ="阿久根市_出水市_伊佐市_長島町_薩摩川内市_霧島市_さつま町_姶良市_湧水町_薩摩川内市甑島_鹿児島市_日置市_いちき串木野市_枕崎市_指宿市_南さつま市_南九州市";
        citys["大隅地方"] ="曽於市_志布志市_大崎町_鹿屋市_垂水市_東串良町_錦江町_南大隅町_肝付町";
        citys["種子島・屋久島地方"] ="西之表市_三島村_中種子町_南種子町_屋久島町";
        citys["奄美地方"] ="十島村_奄美市_大和村_宇検村_瀬戸内町_龍郷町_喜界町_徳之島町_天城町_伊仙町_和泊町_知名町_与論町";
    }else if(ken == "沖縄本島地方"){
        citys["本島北部"] ="伊平屋村_伊是名村_国頭村_大宜味村_東村_名護市_今帰仁村_本部町_伊江村_恩納村_宜野座村_金武町";
        citys["本島中南部"] ="宜野湾市_沖縄市_うるま市_読谷村_嘉手納町_北谷町_北中城村_中城村_那覇市_浦添市_糸満市_豊見城市_南城市_西原町_与那原町_南風原町_八重瀬町_渡嘉敷村_座間味村_粟国村_渡名喜村";
        citys["久米島"] ="久米島町";
    }else if(ken == "大東島地方"){
        citys["大東島地方"] ="南大東村_北大東村";
    }else if(ken == "宮古島地方"){
        citys["宮古島地方"] ="宮古島市_多良間村";
    }else if(ken == "八重山地方"){
        citys["石垣島地方"] ="石垣市_竹富町";
        citys["与那国島地方"] ="与那国町";
    }else{
        citys["東京地方"] ="台東区_墨田区_江東区_荒川区_足立区_葛飾区_江戸川区_千代田区_中央区_港区_新宿区_文京区_品川区_目黒区_大田区_世田谷区_渋谷区_中野区_杉並区_豊島区_北区_板橋区_練馬区_立川市_武蔵野市_三鷹市_府中市_昭島市_調布市_小金井市_小平市_東村山市_国分寺市_国立市_狛江市_東大和市_清瀬市_東久留米市_武蔵村山市_西東京市_青梅市_福生市_羽村市_あきる野市_瑞穂町_日の出町_檜原村_奥多摩町_八王子市_町田市_日野市_多摩市_稲城市";
        citys["伊豆諸島北部"] ="大島町_利島村_新島村_神津島村";
        citys["伊豆諸島南部"] ="三宅村_御蔵島村_八丈町_青ヶ島村";
        citys["小笠原諸島"] ="小笠原村";
    }
    return citys;
}